#+title:     Ectorepo: Astral
#+author:    David Conner
#+email:     noreply@te.xel.io
#+PROPERTY: header-args+ :comments none :var enable-restclient=(setq-local restclient-enable-eval "yes")

#+begin_quote
High-performance developer tools for the Python ecosystem.
#+end_quote



When using =repo init -u $url -m $manifest= instead of the git submodule to
checkout, the filepaths for =<include name=mnfst.xml/>= are relative to the root
repository.

#+begin_src xml :tangle default.xml
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="astral/astral.xml"/>
  <project path="RustPython/interpreter" name="RustPython/RustPython" revision="refs/heads/main" />
  <project path="RustPython/parser" name="RustPython/Parser" revision="refs/heads/main" />
</manifest>
#+end_src

* Code

** astral-sh

*** uv

+ Example pyproject.toml files in [[https://github.com/astral-sh/uv/tree/main/ecosystem][ecosystem/**.pyproject.toml]]

*** packse

The =packse= tool shows dep trees of scenarios

+ JSON description of dependency trees in [[https://github.com/astral-sh/packse/blob/main/scenarios/examples][scenarios/examples]]; elsewhere in
  ./scenarios are mostly toml & yaml scenarios. The schema doesn't correspond to
  =uv.json= in the schema store


* Setup

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
((limit . 5000) (cost . 1) (remaining . 5000) (resetAt . "2025-02-21T04:38:22Z"))
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src


#+name: nrepos
#+begin_src emacs-lisp
100
#+end_src

#+RESULTS: nrepos
: 100

* Astral

Clone bundle sizes

#+name: astralMetadata
#+begin_src restclient :jq "map([.owner.login, .name, .size, .default_branch, .archived, .updated_at])[] | @csv" :results table :jq-args "--raw-output"
:gh-graphql-url = https://api.github.com/graphql
:gh-url-base = https://api.github.com
:gh-org = astral-sh
:gh-url-path = orgs/:gh-org/repos
:gh-token := (auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")

:headers = <<
Accept: application/vnd.github+json
Authorization: Bearer :gh-token
X-GitHub-Api-Version: 2022-11-28
User-Agent: Emacs
#

GET :gh-url-base/:gh-url-path
:headers
#+end_src

#+RESULTS: astralMetadata
| astral-sh | transformers                | 158147 | main   | false | 2025-06-04T08:09:20Z |
| astral-sh | uv                          | 127102 | main   | false | 2026-01-09T00:49:01Z |
| astral-sh | ruff                        | 115476 | main   | false | 2026-01-09T00:04:38Z |
| astral-sh | RustPython                  |  62003 | main   | true  | 2025-09-10T00:49:16Z |
| astral-sh | schemastore                 |  34178 | master | false | 2025-12-22T03:27:33Z |
| astral-sh | docs                        |  30099 | main   | false | 2026-01-08T19:26:24Z |
| astral-sh | setup-uv                    |  15686 | main   | false | 2026-01-08T19:14:02Z |
| astral-sh | packse                      |  10211 | main   | false | 2025-12-31T13:46:14Z |
| astral-sh | RustPython-Parser           |   5118 | main   | true  | 2025-08-27T06:53:01Z |
| astral-sh | rye                         |   3535 | main   | false | 2026-01-08T23:50:35Z |
| astral-sh | python-build-standalone     |   3488 | main   | false | 2026-01-08T22:08:13Z |
| astral-sh | pubgrub                     |   2428 | main   | false | 2025-11-24T11:55:35Z |
| astral-sh | ruff-action                 |   2344 | main   | false | 2026-01-05T08:51:07Z |
| astral-sh | ruff-vscode                 |   2137 | main   | false | 2026-01-08T19:46:05Z |
| astral-sh | rs-async-zip                |    803 | main   | false | 2025-11-29T19:12:43Z |
| astral-sh | lsp-types                   |    709 | master | false | 2024-04-29T18:12:29Z |
| astral-sh | ruff-lsp                    |    634 | main   | true  | 2026-01-05T16:15:35Z |
| astral-sh | reqwest-middleware          |    246 | main   | false | 2025-12-18T10:36:53Z |
| astral-sh | ruff-pre-commit             |    205 | main   | false | 2026-01-08T19:21:12Z |
| astral-sh | astral-tl                   |    201 | main   | false | 2026-01-02T19:08:09Z |
| astral-sh | uv-docker-example           |    125 | main   | false | 2026-01-08T15:49:03Z |
| astral-sh | uv-pre-commit               |     97 | main   | false | 2026-01-06T12:10:04Z |
| astral-sh | trusted-publishing-examples |     34 | main   | false | 2025-12-17T08:57:38Z |
| astral-sh | uv-fastapi-example          |     28 | main   | false | 2025-12-26T09:47:41Z |
| astral-sh | nginx_pypi_cache            |     12 | master | false | 2025-04-04T03:50:29Z |
| astral-sh | pypi-proxy                  |     10 | main   | false | 2025-09-09T15:40:47Z |
| astral-sh | workspace-virtual-root-test |      6 | main   | false | 2025-04-04T03:50:32Z |
| astral-sh | uv-flask-example            |      4 | main   | false | 2025-10-26T09:58:04Z |
| astral-sh | sanitize-wheel-test         |      3 | main   | false | 2025-04-04T03:50:30Z |
| astral-sh | workspace-in-root-test      |      1 | main   | false | 2025-04-04T03:50:32Z |


#+NAME: astralReposExclude
| schemastore  |
| transformers |
| .github      |


** Astral Repos

#+name: astralRepos
#+begin_src emacs-lisp :var nrepos=60 :results replace vector value :exports code :noweb yes
(ghub-graphql
 (graphql-query ((organization
                  :arguments ((login . "astral-sh"))
                  (repositories
                   :arguments ((first . <<nrepos()>>)
                               (orderBy . ((field . UPDATED_AT)
                                           (direction . DESC))))
                   (edges
                    (node (owner login)
                          name
                          (defaultBranchRef prefix name)
                          url
                          updatedAt
                          isArchived)))))))
#+end_src

Filter the results, generate XML

#+name: astralReposXML
#+begin_src emacs-lisp :var gqldata=astralRepos repos-exclude=astralReposExclude :results value html
(setq -gql-data gqldata)

;; no repos-core variable
;; (repos-core (flatten-list repos- core))

(let* ((repos-exclude (flatten-list repos-exclude)))
  (thread-first
    (thread-last
      (a-get* (nthcdr 0 gqldata) 'data 'organization 'repositories 'edges)
      (mapcar (lambda (el) (a-get* el 'node)))

      ;; filter archived repos
      (seq-filter (lambda (el) (not (a-get* el 'isArchived))))

      ;; filter repos in reposExclude list
      (seq-filter (lambda (el) (not (member (a-get* el 'name) repos-exclude))))
      (mapcar (lambda (el)
                (let* ((raw-name (a-get* el 'name))

                       ;; (repo-core? (member raw-name repos-core))

                       ;; (path-dirs (list "astral" raw-name))
                       (path-dirs (list raw-name))

                       ;; (path-dirs (cond (repo-core? (list "core" raw-name))
                       ;;                 (t (list "misc" raw-name))))

                       (path (string-join path-dirs "/"))
                       (ref (concat (a-get* el 'defaultBranchRef 'prefix)
                                    (a-get* el 'defaultBranchRef 'name)))
                       (name (string-join (list (a-get* el 'owner 'login)
                                                (a-get* el 'name)) "/")))
                  (concat "<project"
                          " name=\"" name
                          "\" path=\"" path
                          "\" revision=\"" ref "\" remote=\"github\"/>")))))
    (cl-sort 'string-lessp :key 'downcase)
    (string-join "\n")))
#+end_src

#+RESULTS: astralReposXML
#+begin_export html
<project name="astral-sh/ambient-id" path="ambient-id" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/archive-in-git-test" path="archive-in-git-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/astral-tl" path="astral-tl" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/async_http_range_reader" path="async_http_range_reader" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/attest-action" path="attest-action" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/docs" path="docs" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/docstring-adder" path="docstring-adder" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ecosystem-analyzer" path="ecosystem-analyzer" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/lfs-cowsay" path="lfs-cowsay" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/lsp-types" path="lsp-types" revision="refs/heads/master" remote="github"/>
<project name="astral-sh/mirror" path="mirror" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/mypy_primer" path="mypy_primer" revision="refs/heads/master" remote="github"/>
<project name="astral-sh/nginx_pypi_cache" path="nginx_pypi_cache" revision="refs/heads/master" remote="github"/>
<project name="astral-sh/packse" path="packse" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/pubgrub" path="pubgrub" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/pypi-proxy" path="pypi-proxy" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/python-build-standalone" path="python-build-standalone" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/pyx-auth-action" path="pyx-auth-action" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/renovate-config" path="renovate-config" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/reqwest-middleware" path="reqwest-middleware" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/rs-async-zip" path="rs-async-zip" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ruff" path="ruff" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ruff-action" path="ruff-action" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ruff-pre-commit" path="ruff-pre-commit" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ruff-vscode" path="ruff-vscode" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/rye" path="rye" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/sanitize-wheel-test" path="sanitize-wheel-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/setup-uv" path="setup-uv" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/sigstore-models" path="sigstore-models" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/test-lfs-repo" path="test-lfs-repo" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/tokio-tar" path="tokio-tar" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/trusted-publishing-examples" path="trusted-publishing-examples" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ty" path="ty" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/ty-vscode" path="ty-vscode" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv" path="uv" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-aws-lambda-example" path="uv-aws-lambda-example" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-backwards-path-test" path="uv-backwards-path-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-cloudflare-workers-example" path="uv-cloudflare-workers-example" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-docker-example" path="uv-docker-example" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-dynamic-metadata-test" path="uv-dynamic-metadata-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-ecosystem-testing" path="uv-ecosystem-testing" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-fastapi-example" path="uv-fastapi-example" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-flask-example" path="uv-flask-example" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-path-dependency-test" path="uv-path-dependency-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-pre-commit" path="uv-pre-commit" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uv-stale-egg-info-test" path="uv-stale-egg-info-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/uvx-dummy" path="uvx-dummy" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/wiremock-rs" path="wiremock-rs" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/workspace-in-root-test" path="workspace-in-root-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/workspace-virtual-root-test" path="workspace-virtual-root-test" revision="refs/heads/main" remote="github"/>
<project name="astral-sh/workspace-with-root-dependency-test" path="workspace-with-root-dependency-test" revision="refs/heads/main" remote="github"/>
#+end_export


** Generate XML

Generate =astral.xml=

#+begin_src xml :tangle astral.xml :noweb yes
<manifest>
  <<astralReposXML()>>
</manifest>
#+end_src
